---
kind: property
id: P:Autodesk.Revit.DB.FabricationService.ServiceId
source: html/f9b3e6cc-935f-20e1-1985-323589f08e90.htm
---
# Autodesk.Revit.DB.FabricationService.ServiceId Property

The service identifier of the service.

## Syntax (C#)
```csharp
public int ServiceId { get; }
```